toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14/0.orig/U
FoamFile { format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0]; internalField uniform (0 0 0);
boundaryField
{
 inlet { type fixedValue; value uniform (0 0 0); }
 outlet { type zeroGradient; }
 farfield { type symmetryPlane; }
 rotor { type movingWallVelocity; value uniform (0 0 0); }
 duct { type fixedValue; value uniform (0 0 0); }
}

