toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14/0.orig/k
FoamFile { format ascii; class volScalarField; object k; }
dimensions [0 2 -2 0 0 0 0]; internalField uniform 1e-8;
boundaryField { inlet { type fixedValue; value uniform 1e-8; } outlet { type zeroGradient; } farfield { type symmetryPlane; } rotor { type kqRWallFunction; value uniform 1e-8; } duct { type kqRWallFunction; value uniform 1e-8; } }

