toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14/0.orig/nut
FoamFile { format ascii; class volScalarField; object nut; }
dimensions [0 2 -1 0 0 0 0]; internalField uniform 0;
boundaryField { inlet { type calculated; value uniform 0; } outlet { type calculated; value uniform 0; } farfield { type symmetryPlane; } rotor { type nutUSpaldingWallFunction; value uniform 0; } duct { type nutUSpaldingWallFunction; value uniform 0; } }

