toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14/0.orig/omega
FoamFile { format ascii; class volScalarField; object omega; }
dimensions [0 0 -1 0 0 0 0]; internalField uniform 1;
boundaryField { inlet { type fixedValue; value uniform 1; } outlet { type zeroGradient; } farfield { type symmetryPlane; } rotor { type omegaWallFunction; value uniform 1; } duct { type omegaWallFunction; value uniform 1; } }

