toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14/0.orig/p
FoamFile { format ascii; class volScalarField; object p; }
dimensions [0 2 -2 0 0 0 0]; internalField uniform 0;
boundaryField { inlet { type zeroGradient; } outlet { type fixedValue; value uniform 0; } farfield { type symmetryPlane; } rotor { type zeroGradient; } duct { type zeroGradient; } }

