toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14/constant/transportProperties
FoamFile { format ascii; class dictionary; object transportProperties; }
transportModel Newtonian;
nu [0 2 -1 0 0 0 0] 1.05e-6;

