toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14/constant/turbulenceProperties
FoamFile { format ascii; class dictionary; object turbulenceProperties; }
simulationType RAS;
RAS { RASModel kOmegaSST; turbulence on; printCoeffs on; }

