toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14/system/blockMeshDict
FoamFile { format ascii; class dictionary; object blockMeshDict; }
convertToMeters 1;
vertices ((-0.2 -0.2 -0.2) (0.4 -0.2 -0.2) (0.4 0.2 -0.2) (-0.2 0.2 -0.2) (-0.2 -0.2 0.2) (0.4 -0.2 0.2) (0.4 0.2 0.2) (-0.2 0.2 0.2));
blocks (hex (0 1 2 3 4 5 6 7) (100 67 67) simpleGrading (1 1 1));
edges ();
boundary
(
 inlet { type patch; faces ((0 4 7 3)); }
 outlet { type patch; faces ((1 2 6 5)); }
 farfield { type symmetryPlane; faces ((0 1 5 4) (3 7 6 2) (0 3 2 1) (4 5 6 7)); }
);
mergePatchPairs ();

