toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14/system/controlDict
FoamFile { format ascii; class dictionary; object controlDict; }
application simpleFoam; startFrom startTime; startTime 0; stopAt endTime; endTime 4000; deltaT 1; writeControl timeStep; writeInterval 250; purgeWrite 2; writeFormat binary; writePrecision 8; runTimeModifiable true;
functions
{
 rotorForces { type forces; libs ("libforces.so"); patches (rotor); rho rhoInf; rhoInf 1025; CofR (0 0 0); writeControl timeStep; writeInterval 10; }
 ductForces { type forces; libs ("libforces.so"); patches (duct); rho rhoInf; rhoInf 1025; CofR (0 0 0); writeControl timeStep; writeInterval 10; }
 residuals { type residuals; libs ("libutilityFunctionObjects.so"); fields (U p k omega); writeControl timeStep; writeInterval 1; }
 yPlus { type yPlus; libs ("libfieldFunctionObjects.so"); writeControl timeStep; writeInterval 100; }
}

