toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14/system/setFieldsDict
FoamFile { format ascii; class dictionary; object setFieldsDict; }
defaultFieldValues (volScalarFieldValue p 0 volVectorFieldValue U (0 0 0) volScalarFieldValue k 1e-8 volScalarFieldValue omega 1);
regions ();

