toroidal_rov_thruster/prototype1D_1B14_openFOAM/prototype1D_1B14/system/surfaceFeatureExtractDict
FoamFile { format ascii; class dictionary; object surfaceFeatureExtractDict; }
rotor_1B14.stl { extractionMethod extractFromSurface; extractFromSurfaceCoeffs { includedAngle 150; } writeObj yes; }
duct_1B14.stl { extractionMethod extractFromSurface; extractFromSurfaceCoeffs { includedAngle 150; } writeObj yes; }

